# Здесь хранятся все переменные

base_url = 'https://hh.ru'
user_mail = 'qartamonov@gmail.com'

valid_title_login = 'Работа в Москве, поиск персонала и публикация вакансий - hh.ru'

start_words_in_title = ['тестировщик', 'qa', 'engineer', 'специалист по тестированию', 'aqa', 'автоматизатор',
                        'по внедрению по']

stop_words_in_title = ['middle', 'в офис', 'проникновение', 'пентестер', 'lead', 'performance',
                   'старший', 'аналитик', 'mobile', 'senior', 'мобильных', 'мастер', 'офис в центре города',
                   'мобильного', 'ведущий', 'за рулем', 'mmorpg', 'driving', 'android', '1c', '1с',
                   'офис', 'gamedev', 'не удаленно', 'только', 'администратор', 'не web', 'программист']

stop_word_item = ['не удалено', 'удаленки нет', 'только офис', 'только офисный',
                  'оборудованное рабочее место', 'опыт обязателен от 2 лет', 'от 2 лет',
                  'от 3 лет', 'от 2х лет', 'от 3х лет', 'возможность удаленной работы отсутствует',
                  '3–6 лет', 'рабочее место', 'строго в офисе', '2+', '2–6 лет', '3+', '2-х лет'
                  'intermediate', 'от двух лет', 'от метро', 'недалеко от', '1с', '1c', '3-x лет'
                  'удаленной работы нет', 'смотреть отклик', 'кухней', 'кухня', 'рядом с метро',
                  'класса a', 'класса b', 'класса а', 'класса в', 'уютный офис',
                  'вкусняшки', 'вкусняшками', 'не удалённо']

